[{"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch", "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."}, {"title": "NASA's Curiosity Rover Finds an Ancient Oasis on Mars", "preview": "New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate."}, {"title": "NASA's Mars Helicopter Attached to Mars 2020 Rover ", "preview": "The helicopter will be first aircraft to perform flight tests on another planet."}, {"title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"title": "The Detective Aboard NASA's Perseverance Rover", "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"title": "NASA Readies Perseverance Mars Rover's Earthly Twin ", "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}, {"title": "NASA's Perseverance Rover Will Peer Beneath Mars' Surface ", "preview": "The agency's newest rover will use the first ground-penetrating radar instrument on the Martian surface to help search for signs of past microbial life. "}, {"title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter", "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."}, {"title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"title": "Mars Scientists Investigate Ancient Life in Australia", "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "}, {"title": "Scientists Explore Outback as Testbed for Mars ", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}]